{
    "project1": {
        "title": "Nilaiku (2023)",
        "excerpt": "An OMR based exam grader app. Built for educational institutions to automate and streamline the grading process.",
        "image": "assets/banner/exam-scanner-2023.webp",
        "buttonColor": "green",
        "description": "Nilaiku is a sophisticated web application developed as a final academic project, focusing on automating the grading process for standardized bubble sheet exams using Optical Mark Recognition (OMR). The system replaces manual correction with a fast, accurate, and scalable computer vision solution integrated into a full-featured web platform.",
        "contributions": [
            "Developed the OMR algorithm using Python and OpenCV to accurately detect and interpret marked answers on bubble sheets.",
            "Built the backend using Django to handle user authentication and result processing.",
            "Designed a responsive frontend with Bootstrap to provide an intuitive user interface for teachers.",
            "Integrated Google Auth for secure user login."
        ],
        "techStack": ["Python", "JavaScript", "HTML", "CSS", "Django", "Bootstrap", "MySQL", "Google Cloud"],
        "liveLink": "https://github.com/dafalagi/Nilaiku"
    },
    "project2": {
        "title": "Travel Booking Engine and Management (2024)",
        "excerpt": "Booking engine and internal management apps for a travel agency.",
        "image": "assets/banner/travel-project-2024.webp",
        "buttonColor": "blue",
        "description": "A custom-built travel booking and full-stack management system designed to streamline the reservation process for flights, accommodations, and related services, while providing robust administrative tools for operational efficiency.",
        "contributions": [
            "Engineered the management functionalities which incorporated front-end and back-end logic.",
            "Designed and built an API for booking engine.",
            "Implemented user authentication and role-based access control for different user types (customers, agents, admins).",
            "Designed and implemented the database schema.",
            "Integrated third-party APIs including payment gateway, WhatsApp notification, and email services."
        ],
        "techStack": ["PHP", "JavaScript", "HTML", "CSS", "Laravel", "Livewire", "Bootstrap", "PostgreSQL", "Redis"],
        "liveLink": null
    },
    "project3": {
        "title": "Villa Management System (2024)",
        "excerpt": "A comprehensive system for managing villa rentals, including booking, resource management, and marketing functionalities.",
        "image": "assets/banner/villa-project-2024.webp",
        "buttonColor": "green",
        "description": "A custom, comprehensive Villa Management System (VMS) designed to streamline villa rental operations, including booking, resource management, marketing functionalities. This is a full-stack web application that I joined halfway through development to enhance backend functionalities and ensure seamless integration with the frontend.",
        "contributions": [
            "Enhanced backend functionalities to improve booking management and villa availability tracking.",
            "Collaborated with frontend developers to ensure seamless integration between backend services and user interface.",
            "Optimized database queries to improve application performance and responsiveness.",
            "Fixed bugs and implemented new features based on employee feedback.",
            "Implemented date import feature to streamline villa availability updates from third-party booking systems."
        ],
        "techStack": ["PHP", "JavaScript", "HTML", "CSS", "Laravel", "Bootstrap", "MySQL"],
        "liveLink": "https://totalbali.com/"
    },
    "project4": {
        "title": "ERP (2025)",
        "excerpt": "\"Super App\" consisted of three management systems which include Human Resource, Cost Control, and Helpdesk.",
        "image": "assets/banner/pillar-project-2025.webp",
        "buttonColor": "green",
        "description": "Enterprise Resource Planning (ERP) is a centralized, modular \"Super App\" developed to converge three essential business functions: Human Resources (HR), Cost Control (Finance), and Helpdesk (Maintenance/IT support). The platform eliminates data silos, enforces unified operational governance, and provides a single pane of glass for employee services and organizational resource control.",
        "contributions": [
            "Built Helpdesk system for efficient issue tracking and resolution.",
            "Created Cost Control modules to monitor and manage expenses.",
            "Developed and integrated Human Resource management features.",
            "Optimized application performance and user experience.",
            "Implemented role-based access control to ensure data security and proper authorization across different modules."
        ],
        "techStack": ["PHP", "Laravel", "PostgreSQL"],
        "liveLink": null
    },
    "project5": {
        "title": "Hotel Booking Engine (2025)",
        "excerpt": "Online booking engine system designed to streamline reservations and operations for hospitality businesses.",
        "image": "assets/banner/hotel-booking-2025.webp",
        "buttonColor": "blue",
        "description": "A fully integrated and robust Online Booking Engine (OBE). The system is engineered to maximize hotel revenue through efficient direct booking capabilities while streamlining core operations such as guest check-in and financial reporting.",
        "contributions": [
            "Implemented management features including reservation management, guest check-in, and reporting tools.",
            "Integrated third-party services such as payment gateways, notification systems, and mailing services.",
            "Collaborated with marketing team to optimize promotional campaigns.",
            "Ensured data security and compliance with industry standards for online transactions.",
            "Integrated real-time availability and pricing updates."
        ],
        "techStack": ["PHP", "Laravel", "PostgreSQL"],
        "liveLink": "https://booking.grandiahotel.com/"
    },
    "project6": {
        "title": "Field Sales Nexus (2025)",
        "excerpt": "Dual-interface application primarily focused on helping field sales teams manage their activities and store interactions efficiently.",
        "image": "assets/banner/salesperson-project-2025.webp",
        "buttonColor": "green",
        "description": "A comprehensive, dual-interface application designed to optimize field sales operations, streamline order placement, and centralize store management. It empowers sales representatives with a dedicated mobile application for on-site activities while providing administrators with a powerful web-based platform for holistic oversight and control.",
        "contributions": [
            "Implemented features for order placement, customer management, and activity tracking.",
            "Optimized API architecture for performance and scalability.",
            "Collaborated with mobile and front-end developers to ensure smooth integration and functionality across platforms.",
            "Enhanced user experience through cache management.",
            "Developed reporting tools to provide insights into sales performance and customer behavior."
        ],
        "techStack": ["PHP", "Laravel", "PostgreSQL"],
        "liveLink": null
    },
    "project7": {
        "title": "CRM (2025)",
        "excerpt": "Customer Relationship Management (CRM) system designed to help businesses manage interactions with current and potential customers.",
        "image": "assets/banner/crm-project-2025.webp",
        "buttonColor": "green",
        "description": "A specialized, multi-service CRM and operational hub designed for corporations offering external services such as engineering, housekeeping, and security to clients. The system centralizes client management, automates the service ticketing lifecycle, and provides real-time visibility into field staff deployment and service resolution.",
        "contributions": [
            "Developed service ticketing system to manage client requests and track resolution progress.",
            "Implemented client management features to maintain comprehensive records of interactions and service history.",
            "Created real-time dashboards for monitoring field staff activities and service status.",
            "Optimized backend processes to ensure efficient data handling and reporting.",
            "Collaborated with mobile and front-end developers to deliver a seamless user experience."
        ],
        "techStack": ["PHP", "Laravel", "PostgreSQL"],
        "liveLink": null
    },
    "project8": {
        "title": "Hotel Room Service (2025)",
        "excerpt": "A room service system designed to enhance guest experience and streamline hotel operations.",
        "image": "assets/banner/room-service-2025.webp",
        "buttonColor": "blue",
        "description": "A tri-platform hospitality solution engineered to digitize and optimize the end-to-end hotel room service experience. It eliminates phone-based ordering and manual ticketing by providing a seamless interface for guests (Web App) and a dedicated fulfillment tool for hotel staff (Mobile App), all managed by a central administration hub.",
        "contributions": [
            "Implemented backend functionalities to manage orders, track service statuses, and coordinate staff assignments.",
            "Integrated payment processing and WhatsApp notification systems for seamless transactions and communication.",
            "Collaborated with mobile and front-end developers to deliver a cohesive and intuitive design.",
            "Implemented QR code ordering feature to streamline guest interactions.",
            "Ensured API security even with public access from guest devices using QR based authentication."
        ],
        "techStack": ["PHP", "Laravel", "PostgreSQL"],
        "liveLink": null
    },
    "project9": {
        "title": "Laravel SOA Starter (2025)",
        "excerpt": "A starter template for building Laravel applications using Service-Oriented Architecture (SOA) principles.",
        "image": "assets/banner/soa-starter-2025.webp",
        "buttonColor": "green",
        "description": "A boilerplate template designed to kickstart Laravel projects using Service-Oriented Architecture (SOA) principles. This starter kit provides a structured foundation for building scalable and maintainable applications by promoting modularity and separation of concerns.",
        "contributions": [
            "Designed the project structure to facilitate SOA principles.",
            "Implemented a rigorous Service Layer pattern, ensuring that all complex business logic resides outside controllers.",
            "Enforced modular monolith architecture to enhance code organization and division of responsibilities.",
            "Provided documentation to guide developers in utilizing the starter template effectively.",
            "Optimized for scalability and maintainability."
        ],
        "techStack": ["PHP", "Laravel", "PostgreSQL"],
        "liveLink": "https://github.com/dafalagi/laravel-soa-starter"
    },
    "project10": {
        "title": "E-Commerce Platform (2025)",
        "excerpt": "A full-featured e-commerce platform designed to facilitate online shopping experiences.",
        "image": "assets/banner/ecommerce-2025.webp",
        "buttonColor": "green",
        "description": "A comprehensive e-commerce platform engineered to provide a seamless online shopping experience. The system encompasses a wide range of features, including product browsing, shopping cart management, and order tracking, all designed to enhance user engagement and drive sales.",
        "contributions": [
            "Developed product catalog and browsing functionalities.",
            "Implemented shopping cart and checkout processes.",
            "Integrated real-time notifications for product updates.",
            "Optimized user experience through responsive design and intuitive navigation.",
            "Implemented order tracking features."
        ],
        "techStack": ["PHP", "Laravel", "PostgreSQL", "Livewire", "Tailwind CSS", "Redis"],
        "liveLink": "https://github.com/dafalagi/e-commerce-trial"
    }
}
